[
    {
        "link": "https://vacancymail.co.zw/jobs/accounting-officer-62013/",
        "title": "Accounting Officer",
        "company": "First Pack Marketing",
        "location": "Harare",
        "expiry_time": "04 Jan 2025",
        "job_type": "Full Time",
        "duties_and_responsibilities": "Performing monthly Bank Reconciliation<br/>Prepare and submit auction bids timeously<br/>Supplier reconciliations monthly by the 5th of every month<br/>Cash ledgers {petty cash ,cash pool and cash on hand}reconciliations<br/>Capturing of monthly expenses<br/>Checking on finance weekly report<br/>Performing fincon  ledger period end timeously by the close of every month",
        "qualifications_and_experience": "*Degree in Accounting<br/>*Experience is an added advantage",
        "how_to_apply": "hr@firstpack.co.zw",
        "salary_amount": "negotiable"
    },
    {
        "link": "https://vacancymail.co.zw/jobs/trainee-parts-picker-62012/",
        "title": "TRAINEE PARTS PICKER",
        "company": "KOPJE SPARE  PARTS  DISTRIBUTORS (PVT) LTD",
        "location": "Harare",
        "expiry_time": "27 Dec 2024",
        "job_type": "Full Time",
        "duties_and_responsibilities": "-Stores  management training",
        "qualifications_and_experience": "1. Good O levels and or A level a must<br/>2. Must be aged 24 years and below<br/>3. Certificate or Diploma in Stores and Materials Management is an added advantage<br/>4. Must be flexible to work in any province in Zimbabwe<br/>5. No chancers",
        "how_to_apply": "Interested candidates meeting the above criteria should submit their detailed CVs and application letters to kspdrecruitment@gmail.com not later than 27 December 2024",
        "salary_amount": null
    },
    {
        "link": "https://vacancymail.co.zw/jobs/graduate-trainee-digital-marketing-62011/",
        "title": "Graduate Trainee -Digital Marketing",
        "company": "Solten Financial Services (Pvt.) Ltd",
        "location": "Harare",
        "expiry_time": "05 Jan 2025",
        "job_type": "Full Time",
        "duties_and_responsibilities": "- Develop and Execute Campaigns: Create and manage online marketing campaigns across social media, email, and search engines. <br/>- SEO &amp; SEM: Optimize content for search engines and manage paid advertising campaigns (PPC). <br/>- Content Creation: Produce engaging content for websites, blogs, and social media. <br/>- Track Performance: Use Google Analytics and other tools to measure campaign performance and adjust strategies accordingly. <br/>- Social Media Management: Engage with followers and increase brand awareness across social media platforms. <br/>- Should have a solid foundation in graphic designing <br/>- Market Research: Monitor industry trends, competitors, and customer preferences to refine digital strategies. <br/>- Assist in operations reconciliations and any other assigned tasks",
        "qualifications_and_experience": "-Diploma or Degree in Marketing/Digital marketing/Media and Communication<br/>-Proficiency in AI, Corel Draw, Editing and other Graphic design tools <br/>- Design tools Demonstrable experience (2+ years)in digital marketing, with a strong portfolio. <br/>- Expertise in SEO, PPC, and social media advertising. <br/>- Proven experience in business development. - Excellent negotiation, communication, and interpersonal skill",
        "how_to_apply": "Send CV and application letter to hr@solten.co.zw",
        "salary_amount": "TBA"
    },
    {
        "link": "https://vacancymail.co.zw/jobs/finance-administration-intern-62010/",
        "title": "Finance & Administration Intern",
        "company": "Centre for Conflict Management and Transformation",
        "location": "Harare",
        "expiry_time": "03 Jan 2025",
        "job_type": "Full Time",
        "duties_and_responsibilities": "-\tAssist the Finance and Administration Department with accounts payable, including processing invoices, verifying payments, and maintaining accurate records.<br/>-\tAssist with accounts receivable, including preparing invoices, sending payment reminders, and collecting payments.<br/>-\tFile financial documents and ensure their accuracy and accessibility.<br/>-\tEnter financial transactions into the system and maintain accurate records. <br/>-\tConduct reconciliations to ensure accuracy of financial data. <br/>-\tParticipate in budgeting and forecasting, including analysing financial data and preparing reports. <br/>-\tAssist with bank reconciliations.<br/>-\tParticipate in the preparation of financial reports, including income statements, balance sheets, and cash flow statements.<br/>-\tParticipate in audits and donor compliance checks. <br/>-\tMaintain a clean and organized filing system.<br/>-\tStay up to date on changes in accounting rules and regulations.<br/>-\tAssist in the review of supporting documents for payments and financial reports.<br/>-\tSupport filing management and carry out administrative duties such as filing, typing, copying, binding, scanning, printing etc.<br/>-\tMaintain office supplies inventory by checking stock to determine inventory level, anticipating needed supplies, placing and expediting orders, verifying receipt of supplies.<br/>-\tDeveloping and maintaining a database of service providers.<br/>-\tObtaining quotations from service providers and preparing supporting documents as required in terms of procurement procedures of CCMT and funding partners.<br/>-\tOrganizing travel arrangements and booking conference/workshop facilities and accommodation for project teams and activities.<br/>-\tAny other duties as may be assigned from time to time",
        "qualifications_and_experience": "-\tCandidate must be pursuing a Degree in Accounting, Finance, Business Administration or other relevant fields from a reputable institution ",
        "how_to_apply": "If you are interested to work in a small team of dedicated colleagues and have the necessary qualification, experience and attitude, we are looking forward to receiving your CV and application letter via email by the 27th of December 2024. In your application letter clearly state the position that you are applying for, outline your motivation and the special attributes, skills or work experiences which distinguish you from other applicants. Credible references are essential. Only shortlisted candidates will be contacted. Kindly email your application to ccmtrecruitment@gmail.com.",
        "salary_amount": null
    },
    {
        "link": "https://vacancymail.co.zw/jobs/communications-intern-62009/",
        "title": "Communications Intern",
        "company": "Centre for Conflict Management and Transformation",
        "location": "Harare",
        "expiry_time": "03 Jan 2025",
        "job_type": "Internship",
        "duties_and_responsibilities": "-\tDevelop communication strategy for the organisation <br/>-\tDevelop fact sheets, brochures, articles for stakeholder newsletters and the organization's website. <br/>-\tDevelop engaging content for various platforms including website, social media, newsletters, and press releases.<br/>-\tManage and update social media channels, engaging with the audience and monitoring online conversations.<br/>-\tContribute to the planning and execution of organisational events, including creating promotional materials and managing logistics.<br/>-\tDevelop and run media campaigns, including drafting press releases and coordinating with journalists.<br/>-\tMaintain and enhance the organisation's brand image through consistent messaging and visual identity.<br/>-\tConduct research on industry trends, target audiences, and competitive landscapes.<br/>-\tHandle administrative tasks such as scheduling, filing, and report generation.",
        "qualifications_and_experience": "Currently enrolled in a relevant degree program (e.g., Communications, Journalism, Public Relations)<br/>-\tStrong written and verbal communication skills<br/>-\tProficiency in social media platforms and content management systems<br/>-\tExcellent organizational and time management skills<br/>-\tCreative and innovative mindset<br/>-\tAbility to work independently and as part of a team<br/>-\tFamiliarity with design software (e.g., Adobe Creative Suite) is a plus",
        "how_to_apply": "If you are interested to work in a small team of dedicated colleagues and have the necessary qualification, experience and attitude, we are looking forward to receiving your CV and application letter via email by the 27th of December 2024. In your application letter clearly state the position that you are applying for, outline your motivation and the special attributes, skills or work experiences which distinguish you from other applicants. Credible references are essential. Only shortlisted candidates will be contacted. Kindly email your application to ccmtrecruitment@gmail.com.",
        "salary_amount": null
    },
    {
        "link": "https://vacancymail.co.zw/jobs/accounts-attachee-62008/",
        "title": "Accounts attachee",
        "company": "Lightguard Security",
        "location": "Harare",
        "expiry_time": "31 Dec 2024",
        "job_type": "Full Time",
        "duties_and_responsibilities": "1.Assist with daily bookkeeping Support the team in recording financial transactions, maintaining ledgers, and updating accounts.",
        "qualifications_and_experience": "1.Currently pursuing a degree in Accounting, Finance, or related field, or recent graduate.<br/>2.Strong understanding of accounting principles and financial management.<br/>3.Familiarity with accounting software (QuickBooks, SAP, etc.) is a plus.<br/>4.Excellent attention to detail and strong organizational skills.<br/>5.Ability to work effectively in a team environment.<br/>6.Strong communication and interpersonal skills.<br/>7.Proficient in Microsoft Excel and other Microsoft Office applications.",
        "how_to_apply": "Interested candidates are encouraged to submit their resumes and cover letters to lgszimbabwe2@gmail.com",
        "salary_amount": null
    },
    {
        "link": "https://vacancymail.co.zw/jobs/operations-supervisor-62007/",
        "title": "Operations  supervisor",
        "company": "Lightguard Security",
        "location": "Harare",
        "expiry_time": "10 Jan 2025",
        "job_type": "Full Time",
        "duties_and_responsibilities": "Oversee recruitment, training, and development of security guards.<br/>Manage absence, discipline, and grievance processes.<br/>Lead and mentor the security team to enhance performance.<br/>Ensure security services meet customer satisfaction and contractual terms.<br/>Build and maintain customer relationships, addressing requests and concerns.<br/>Conduct health and safety assessments and assist in incident investigations.<br/>Perform risk assessments, site evaluations, and provide performance reports.<br/>Collaborate with sales officers to secure new clients.<br/>Develop and enforce security protocols and procedures.<br/>Assign and manage security guard duties.<br/>Ability to structure a duty roaster and and duty slips<br/>Manage deployment effectively on a day to day basis.<br/>Track security incidents and recommend appropriate actions.",
        "qualifications_and_experience": "1.Minimum of 5 O-Levels or equivalent<br/>2.Security Diploma or higher qualification<br/>3.At least  3-5 years in security supervisory roles.<br/>4.Valid driver's license (Class 3, and 4)<br/>5.Strong leadership, communication, and organizational skills<br/>6.Ability to handle high-pressure situations and provide effective solutions",
        "how_to_apply": "Interested candidates are encouraged to submit their resumes and cover letters to lgszimbabwe2@gmail.com",
        "salary_amount": null
    },
    {
        "link": "https://vacancymail.co.zw/jobs/cashiers-and-nightclub-supervisors-62006/",
        "title": "Cashiers and Nightclub Supervisors",
        "company": null,
        "location": "Bulawayo",
        "expiry_time": "03 Jan 2025",
        "job_type": "Full Time",
        "duties_and_responsibilities": "Job Related",
        "qualifications_and_experience": "Relevant Qualifications",
        "how_to_apply": "Location: Bulawayo<br/>Email cv to: tzuva21@gmail.com<br/>Due date: 3 January 2025",
        "salary_amount": "TBA"
    },
    {
        "link": "https://vacancymail.co.zw/jobs/finance-and-administration-assistant-62005/",
        "title": "Finance and Administration Assistant",
        "company": "Young Africa Zimbabwe",
        "location": "Chitungwiza",
        "expiry_time": "27 Dec 2024",
        "job_type": "Full Time",
        "duties_and_responsibilities": "Financial<br/>•\tHelp ensure implementation of effective internal controls, proper functioning of a financial resources management system, and the control mechanism for projects as spelt in the organisational finance and other related policies.<br/>•\tTimely and accurate procurements and payments with full compliance to organisational and donor rules &amp; regulations <br/>•\tMaintenance of the internal expenditures control system which ensures that purchases processed are matched and completed, transactions are correctly recorded and posted in the accounting system; and travel claims and other entitlements are duly processed.<br/>•\tAllocation of common services expenses and recurring office expenses. <br/>•\tManagement of cash receipts. Money received is timely recorded, banked and reported.<br/>•\tReview all payment requests generated by the programs team, ensuring that all backup documentation and approvals are available for transactions.<br/>•\tProcess travel advances to project staff and follow-up on outstanding balances. <br/>•\tReview project staff travel advances and expense reports for accuracy. <br/>•\tReview travel-related expenditures and expense reports to ensure the necessary back-up documentation is in order and on file.<br/>•\tMonitoring of Travel Advance, Claims and Settlements through preparation and maintenance of Travel -Claim monitoring sheet<br/>•\tSupervise and manage financial and accounting operations including, but not limited to, preparing payment vouchers, maintaining or verifying petty cash transactions, and reconciling petty cash balances, at least once a week.<br/>•\tMaintaining bank balances up-to-date and reconcile accounts monthly.<br/>•\tAssist the programs departments with the financial monitoring of activities in the field according to established procedures and calendars, as needed.<br/>•\tContribute to the preparation of contractually required financial reports, as well as any other financial reports required by the organisation.<br/>•\t Provide the necessary support to the auditors conducting auditing activities and assure the implementation of any audit-based recommendations.<br/>•\tDevelop and maintain efficient filing systems for both physical and electronic documents.<br/>Administrative and Logistical<br/>•\tAdministrative coordination of general travel logistics for the program team working with support to conferences, workshops and retreats.<br/>•\tSupport to assets management and periodic physical assets verification.<br/>•\tEnsure all relevant documentation of asset movements and distributions is properly maintained<br/>•\tSupport the maintenance of premises and common services, insurance, and management of document storage.<br/>•\tMaintenance of files and records relevant to lease agreements and other contracts.<br/>•\tCustodian for management of office stationery supplies including maintenance of a stock list of stationery, distribution of stationery as required by staff, and keeping a log of distribution.<br/>•\tCoordination with petty cash custodians in project offices for timely completion of monthly petty cash reconciliation and replenishment.<br/>•\tTelephone expenses are properly reviewed, and personal usage is followed up and paid timely by individual staff.<br/>•\tAssist in managing procurement processes, including vendor communications and invoice<br/>processing.<br/>•\tSupport month-end and year-end closure through report preparation and submission including e.g., travel claim acquittals, petty cash reconciliation, review and monitoring of receipt accrual, and payment voucher status. <br/>•\tAssist in the preparation of management accounts and project financial reports.",
        "qualifications_and_experience": "•\tA bachelor’s degree in accounting, Finance, or any related field.<br/>•\tAdvanced knowledge of Pastel Partner and Evolution.<br/>•\tExtensive knowledge of Bellina Payroll systems.<br/>•\tAdvanced computer skills in MS Office programs, particularly excel.<br/>•\tAt least 2 years of experience supporting finance and administration in the non-governmental sector and familiarity with donor regulations and administrative procedures.<br/>•\tBe a team player.<br/>•\tA valid and clean class 4 driver’s license is a must.",
        "how_to_apply": "Interested qualified candidates are to send detailed CVs, 1-page motivation letter, and preferred starting salary to humanresources.yazim@youngafrica.org by 5 pm Friday 27 December 2024.",
        "salary_amount": null
    },
    {
        "link": "https://vacancymail.co.zw/jobs/oxfam-in-southern-africa-saf-cluster-model-review-terms-of-reference-62004/",
        "title": "Oxfam in Southern Africa (SAF) Cluster Model Review Terms of Reference",
        "company": "Oxfam",
        "location": "Harare",
        "expiry_time": "10 Jan 2025",
        "job_type": "Full Time",
        "duties_and_responsibilities": "Main Questions/Tasks<br/>Set 1: Regional Approach to Programming – Effectiveness and practical application of<br/>the regional Approach to Programming<br/>1. How effective has the coordination and communication been between thematic teams across<br/>the cluster with regional partners and other relevant stakeholders, including local communities<br/>and governments and regional bodies?<br/>2. How effective has the shift been from individual Country strategies to a single cluster strategy?<br/>What have been the blocking factors? And what enablers can be identified?<br/>3. What has been the effect of adopting a regional approach across the participating cluster<br/>countries in terms of effectiveness and results/impact?<br/>4. Assess the level of alignment of the current human resource capacities in the cluster with the<br/>demands to deliver on the cluster model’s vision and mission. What changes are necessary<br/>to guarantee agility and application of the regional approach to programming?<br/>5. What has been the impact of holding dual roles with thematic and country dimensions on staff<br/>workload, organizational culture, and effectiveness? Kindly make appropriate<br/>recommendations for future configuration of the cluster core structure to address limitations<br/>identified, enhance impact and cost effectiveness.<br/>6. What is the nature of the relationship between Oxfam South Africa (OZA), currently the only<br/>Oxfam affiliate in the SAF Region and the SAF cluster? How can it be improved or leveraged?<br/>7. What needs to be in place to ensure that the cluster model can absorb shocks and stresses<br/>in the operating context?<br/>Set 2: Partnerships – Deepening partner led approaches as an integral part of the cluster<br/>model<br/>1. The cluster model is premised on the assumption that working more with partners would<br/>require less resources, is that correct? What are practical cost neutral options for future<br/>reconfiguration for working more effectively with partner organisations?<br/>2. What forms of partnerships have developed with the cluster? In what ways are these working<br/>to deliver change? What is Oxfam’s value addition in these partnerships or where do partners<br/>see value add of Oxfam? What value do partners bring to Oxfam’s work?<br/>3. How are we resourcing partnerships to realize these assumptions? What is working, what is<br/>not, where are the gaps, with what lessons and outcomes?<br/>4. What is the state of readiness for the cluster to work with partners in out-of-presence SADC<br/>member countries? What support mechanisms are required to leverage and achieve scale<br/>and impact working in such circumstances?<br/>Set 3: Humanitarian Mandate – Appropriateness of cluster model design to support the<br/>delivery of the Humanitarian Mandate<br/>1. What are the implications of the cluster model of presence on Oxfam’s humanitarian mandate<br/>and influence in cluster countries? What are the gaps and how can these be addressed?<br/>2. How effective is the coordination, leadership and management and resource sharing<br/>mechanism of the cluster model with partners to deliver timely and impactful humanitarian<br/>responses?<br/>3. How much of Oxfam’s work shifted over the past 3 years from direct to partner led<br/>implementation? What additional steps are necessary to support the ambition to enhance<br/>partner-led humanitarian programming?<br/>4. Is the in-house technical capacity sufficient to support quality delivery of partner led<br/>humanitarian responses (coordination, resource mobilisation, advisory capacity)? What could<br/>be done differently?<br/>5. Has the level of investments by the Oxfam Confederation into SAF been adequate to support<br/>the delivery of the humanitarian mandate within the cluster model? What cost neutral solutions<br/>can be adopted by the Cluster to enhance the ability of SAF to deliver on the humanitarian<br/>mandate?<br/>Set 4: Systems and Control – Degree of Alignment of SAF Cluster Model with the wider<br/>Confederation architecture, systems, and ways of working<br/>1. What has been the net effect of the cluster model on operational efficiency across countries?<br/>What is the evidence in support of this considering coordination, resource sharing, and<br/>programme delivery over the last 3 years?<br/>2. To what extent are the current accountability lines, policies, and procedures applicable to the<br/>SAF Cluster Model enabling compliance and risk management. Have there been sufficient<br/>shifts within the Confederation to support the model better? What adjustments are necessary<br/>to support the realisation of the cluster vision within the cluster and by key Confederation<br/>stakeholders?<br/>3. What changes are required in the current business support services setup to improve decision<br/>making, transparency, and efficient resource allocation across the cluster?<br/>4. How appropriate is the core structural design of the Cluster for responding to a fast onset<br/>emergency and delivery of quality programming /influencing work working with partner<br/>organisations? What has been the impact on staff welfare and workload? Kindly recommend<br/>cost neutral shifts in the cluster configuration to enhance overall model effectiveness. What<br/>specific actions and timeframe will be needed to effect the required changes needed to<br/>incorporate proposed model alterations?<br/>Set 5: Financial Feasibility/Savings – Model Financially Viability<br/>1. What types of new funding streams have been secured for the effective implementation of<br/>the cluster model, in addition to the traditional sources? What is the donor trend analysis pre<br/>and post cluster formation?<br/>2. What measures exist to ensure quality programme delivery, grant management and<br/>compliance and effective risk management (including safeguarding)? What other steps are<br/>necessary to assure donor confidence?<br/>3. Considering funding sources, budget allocations, and other potential revenue sources and<br/>income strategies, can the revised cluster model be financially viable over the long term?",
        "qualifications_and_experience": "Expected profile of the consultant<br/>The prospective consultant(s) should have an appropriate balance of management and technical<br/>skills, knowledge of the Southern African context and experience in conducting this type of Study.<br/>The consultant(s) must have good communication and strong interpersonal skills. If it is a firm<br/>providing the service, Oxfam would expect a gender balance in the team.<br/>10. What is to be included in the proposal<br/>Anyone interested in conducting this work must include in their application a technical and<br/>financial proposal which includes the following:<br/>A. Technical<br/>- Understanding and interpretation of the Terms of Reference<br/>- Participatory methodology and tools to be used<br/>- Written example of a similar review already carried out<br/>- Time and activity schedule<br/>B. Financial<br/>- Consultant’s daily rate<br/>- Other costs, e.g.; accommodation, travel and printing<br/>C. Competencies<br/>- Organizational and personal capacity statement<br/>- Relevant experience of at least 6 years related to the assignment<br/>- Contacts of organizations previously worked for<br/>- Curriculum Vitae of key personnel<br/>- Working knowledge of both Portuguese and English desiraable",
        "how_to_apply": "CLICK BUTTON BELOW TO DOWNLOAD FULL DOCUMENT",
        "salary_amount": "TBA"
    }
]