[
    {
        "link": "https://vacancymail.co.zw/jobs/sales-rep-62003/",
        "title": "SALES REP",
        "company": "Kumusha Power",
        "location": "Harare",
        "expiry_time": "24 Dec 2024",
        "job_type": "Full Time",
        "duties_and_responsibilities": "Duties and Responsibilities<br/>• Building and sustaining long-lasting relationships with new and existing customers based within an assigned sales territory.<br/>• Traveling within an assigned sales territory to conduct face-to-face meetings with existing and potential customers.<br/>• Continually meeting or exceeding sales targets by selling company products to new and existing customers.<br/>• Developing and implementing an effective sales strategy to drive sales.<br/>• Maintaining an accurate record of all leads, customer accounts, and sales.",
        "qualifications_and_experience": "A Growth Mindset, constantly learning and developing yourself daily.<br/>• Certificate or Diploma in marketing, business administration, communications, or related field is preferred.<br/>• Proven outside sales experience.<br/>• Proficiency in all Microsoft Office applications.<br/>• Strong consultative sales skills.<br/>• Excellent organizational skills.<br/>• Effective communication and negotiation skills.<br/>• Exceptional customer service skills.<br/>• Detail-oriented.<br/>• 1-2 years’ experience.<br/>• Driver’s license, (added advantage)",
        "how_to_apply": "sales@kumushapower.com",
        "salary_amount": "Incentive $100, 10% Comms min"
    },
    {
        "link": "https://vacancymail.co.zw/jobs/buyer-62002/",
        "title": "BUYER",
        "company": "MONTCLAIR HOTEL AND CASINO",
        "location": "Nyanga",
        "expiry_time": "19 Dec 2024",
        "job_type": "Full Time",
        "duties_and_responsibilities": "a)\tNegotiates the purchase of materials and equipment required by the hotel, ensuring that these meet specifications and can be delivered at the correct time at the most favorable prices. <br/>b)\tMonitors purchase orders to ensure that these are modified to meet changes in requirements. <br/>c)\tMaintains up-to-date lists of suppliers and pricing arrangements to ensure that the hotel achieves the most favorable commercial terms. <br/>d)\tMonitors the performance of suppliers and products to ensure that they meet the required standards. <br/>e)\tMaintains an awareness of quantities of stocks of materials and equipment to ensure that shortages are avoided. <br/>f)\tMonitors the purchasing arrangements of different departments and functions to ensure that they are taking advantage of the most favorable terms. <br/>g)\tReports any significant supply problems to ensure that departments and functions are kept aware of any potential difficulties. <br/>h)\tEnsures best prices for all purchases.<br/>i)\tUses three quotations to ascertain best prices.<br/>j)\tStocks holding must be prescribed within levels per department.<br/>k)\tEnsures no stock runs out.<br/>l)\tParticipates in stock takes monthly.<br/>m)\tEnsures stocks do not expire in storage.<br/>n)\tNegotiates with suppliers for favorable credit terms.<br/>o)\tCarries out any other duties as delegated by Superior.",
        "qualifications_and_experience": "a) Minimum of 2 A level passes.<br/>b) Degree or HND in Procurement/ Purchasing and Supply or related field.<br/>c) At least 3 years’ experience working in a similar environment and at the same position.",
        "how_to_apply": "Interested candidates should submit their applications together with copies of CV’s to recruitment@montclair.co.zw not later than 1200 hours of the 19th of December 2024.",
        "salary_amount": null
    },
    {
        "link": "https://vacancymail.co.zw/jobs/we-are-hiring-graduate-trainees-62001/",
        "title": "WE ARE HIRING -GRADUATE TRAINEES",
        "company": "Willowvale Motor Industries Pvt Ltd",
        "location": "Harare",
        "expiry_time": "27 Dec 2024",
        "job_type": "Full Time",
        "duties_and_responsibilities": "Participate in training and development programs to enhance skills and knowledge.",
        "qualifications_and_experience": "MINIMUM QUALIFICATION AND REQUIREMENTS<br/>•\tA relevant degree with a First (1) or Upper Second -Degree class (2.1)<br/>•\tExcellent communication skills<br/>•\tHighly adaptable and emotionally intelligent<br/>•\tShould be 25 years of age and below<br/>•\tMust be computer literate with sound knowledge of Microsoft Office Packages.",
        "how_to_apply": "If you meet the above criteria send your application and CV to recruitment@wmmi.co.zw on or before 27 December 2024. Indicating the discipline   applied for on the subject.",
        "salary_amount": null
    },
    {
        "link": "https://vacancymail.co.zw/jobs/we-are-hiring-motor-mechanic-class-1-62000/",
        "title": "WE ARE HIRING -MOTOR MECHANIC CLASS 1",
        "company": "Willowvale Motor Industries Pvt Ltd",
        "location": "Harare",
        "expiry_time": "27 Dec 2024",
        "job_type": "Full Time",
        "duties_and_responsibilities": "KEY RESPONSIBILITIES:<br/>•\tDiagnose and repair complex faults in vehicles, including electrical and mechanical systems<br/>•\tPerform routine maintenance and servicing, including oil changes, tire rotations, and brake pad replacements<br/>•\tConduct inspections and testing to identify faults and recommend repairs<br/>•\tUse specialized tools and equipment, such as oscilloscopes and multimeters, to diagnose and repair faults<br/>•\tMeet with clients to better understand their concerns and identify the issue<br/>•\tPerform vehicle assessments and alert clients on issues that will prohibit their vehicles from passing roadworthiness inspection<br/>•\tMaintain accurate records of work performed, including repair orders and maintenance records<br/>•\tSupervise and assist subordinate team members with hands-on technical assistance and advice<br/>•\tParticipate in training and development opportunities to stay up-to-date with the latest technologies and techniques",
        "qualifications_and_experience": "QUALIFICATIONS &amp; REQUIREMENTS <br/>•\tApprenticeship-trained mechanic or trade-certified (tested) Class I Journeyman<br/>•\tMinimum of 4 years' experience as a mechanic able to service and repair vehicles as well as perform standard fitments in a franchised dealership<br/>•\tExceptional fault-finding and diagnostic skills, with the ability to work with diagnostic equipment<br/>•\tHigh School Leaving Certificate (5 \"O\" Levels or equivalent)<br/>•\tValid, unendorsed Class IV or higher driving license<br/>•\tComputer skills: Workshop Management Software, MS Word, Excel, Outlook<br/>•\tVery good interpersonal communication skills (both written and verbal)<br/>•\tAnalytical and structured attitude in development, repair, and maintenance tasks",
        "how_to_apply": "If you are a motivated and experienced Class 1 Motor Mechanic looking for a new challenge, please submit your application, and your resume, to recruitment@wmmi.co.zw on or before 27 December 2024. We look forward to hearing from you!",
        "salary_amount": null
    },
    {
        "link": "https://vacancymail.co.zw/jobs/we-are-hiring-service-advisor-61999/",
        "title": "WE ARE HIRING -SERVICE ADVISOR",
        "company": "Willowvale Motor Industries Pvt Ltd",
        "location": "Harare",
        "expiry_time": "27 Dec 2024",
        "job_type": "Full Time",
        "duties_and_responsibilities": "KEY RESPONSIBILITIES<br/>•\tCustomer Vehicle Booking/Scheduling: Coordinate service appointments and ensure a smooth workflow for the workshop.<br/>•\tCustomer Reception: Greet clients warmly, listen to their concerns, and document their service needs accurately.<br/>•\tCustomer Care and Updates: Keep clients informed throughout the service process, addressing questions and concerns promptly.<br/>•\tPost-Service Follow-Up: Ensure customer satisfaction through timely follow-ups after service completion.<br/>•\tQuotation and Documentation Generation: Prepare accurate service quotations and maintain detailed documentation.<br/>•\tJob Allocation: Assign work efficiently to technicians, optimizing time and resources.<br/>•\tQuality Control: Oversee service quality to ensure it meets company standards and customer expectations.<br/>WHAT WE’RE LOOKING FOR<br/>•\tStrong communication and interpersonal skills to provide outstanding customer service.<br/>•\tOrganizational skills to manage scheduling and workflow effectively.<br/>•\tAttention to detail for accurate documentation and quality assurance.<br/>•\tAbility to multi-task in a fast-paced environment.<br/>•\tPrevious experience in a service advisor or related role is a plus!",
        "qualifications_and_experience": "QUALIFICATIONS AND EXPERIENCE<br/>•\tBe a Qualified Diagnostic Technician or equivalent with five (5) years’ experience in a franchised Dealership<br/>•\tPossess a minimum of valid unendorsed Class four driving license.<br/>•\tA Certified Service Advisor or has attended Service Advisor training course.",
        "how_to_apply": "Apply now by sending your CV and application letter to recruitment@wmmi.co.zw on or before 27 December 2024 We look forward to welcoming you to the team.",
        "salary_amount": null
    },
    {
        "link": "https://vacancymail.co.zw/jobs/business-development-officer-61998/",
        "title": "Business Development Officer",
        "company": "First Pack Marketing",
        "location": "Harare",
        "expiry_time": "04 Jan 2025",
        "job_type": "Full Time",
        "duties_and_responsibilities": "Growth of sales turnover and market share<br/>Develop and maintain relationship with existing and potential customers by means of visiting the customer facility or contacting .<br/>Deliver sales presentation to key clients in coordination with sales representatives.<br/>Meet with key clients ,assisting sales teams with maintaining relationships and negotiating and closing deals.<br/>Strategies SWOT analysis ,business and positioning analysis<br/>Manage the sales team and communicate regularly so that they are motivated to achieve all targets<br/>Maintain and improve customer satisfaction ratio and ensure timely and accurate responses to customer enquiries",
        "qualifications_and_experience": "Degree in Economics/Business Studies/Finance",
        "how_to_apply": "sent your cv's to hr@firstpack.co.zw",
        "salary_amount": "negotiable"
    },
    {
        "link": "https://vacancymail.co.zw/jobs/motor-mechanic-61997/",
        "title": "Motor Mechanic",
        "company": "Green Feathers Farm Pvt Ltd",
        "location": "Wedza or Hwedza",
        "expiry_time": "31 Jan 2025",
        "job_type": "Full Time",
        "duties_and_responsibilities": "Key Responsibilities<br/>▪ Disassemble motors and repair, adjust and replace parts; recondition and adjust<br/>ignition.<br/>▪ Tune engines including injectors and generators; repair, fit and adjust valves, pistons,<br/>rings and bearings.<br/>▪ Clean, repair and replace fuel pumps, fuel lines, gauges and electrical wiring systems.<br/>▪ Perform major mechanical repairs; overhaul transmissions, differentials and universal<br/>joints; repair, adjust and line brakes; rebuild and replace air and hydraulic brake<br/>system components; perform front-end alignment and repair.<br/>▪ Complete related maintenance records and report to Workshop Manager.<br/>▪ Inspect and diagnose mechanical defects in farm trucks, automobiles, vans, tractors,<br/>electric carts and other mechanical equipment.<br/>▪ Drive and test farm trucks and provide emergency road service to farm trucks and<br/>vehicles as required.<br/>▪ Read and interpret schematics and diagrams; diagnose and repair mechanical defects<br/>in a variety of vehicles.<br/>▪ Respond to service calls and perform emergency repairs as needed.<br/>▪ Perform lubrication, oil changes, battery maintenance, tire changes and servicing of<br/>equipment. <br/>Maintain work area, equipment and tools in a safe, clean and orderly condition",
        "qualifications_and_experience": "Qualifications, Skills, and Competencies<br/>• A diploma in motor mechanics or equivalent from a reputable institution.<br/>• At least 2 years experience as a motor mechanic.<br/>• Willingness to relocate, stay and live on the farm and adapt to the farm life.<br/>• Strong interpersonal skills, organizational skills, and attention to detail.<br/>• Ability to diagnose and repair mechanical and electrical malfunctions and defects.<br/>• Willingness to relocate, stay and live on the farm and adapt to the farm life.",
        "how_to_apply": "Should you meet the above criteria, kindly submit your application accompanied by a<br/>detailed one document Curriculum Vitae and certified academic certificates in PDF format<br/>ONLY by 31 January 2025. All applications should be emailed to: gffvacancy@gmail.com<br/>clearly stating the position being applied for as your email subject reference",
        "salary_amount": "TBA"
    },
    {
        "link": "https://vacancymail.co.zw/jobs/builder-class-3-61996/",
        "title": "Builder Class 3",
        "company": "Green Feathers Farm Pvt Ltd",
        "location": "Wedza or Hwedza",
        "expiry_time": "31 Jan 2025",
        "job_type": "Full Time",
        "duties_and_responsibilities": "Duties and Responsibilities<br/>• All aspects of works related to bricklaying, plastering, roofing and painting<br/>• If required, on certain jobs, control the work carried out by other members of the team<br/>• Performs a variety of rough and finish carpentry work.<br/>• Performs skilled mill and cabinet work involving construction, roofing, finishing, and<br/>repairing of buildings, doors, and other building-related items.<br/>• Perform skilled carpentry work in the maintenance, repair, construction, alteration,<br/>forming, framing, and finishing of GFF buildings and facilities.<br/>• Construct, install, maintain and repair woodwork.<br/>• Estimate labour and material costs.<br/>• Perform duties effectively, timely, and without supervision.<br/>• Perform other duties as assigned.",
        "qualifications_and_experience": "Job Skills and Competences<br/>• Willingness to relocate, stay and live on the farm, and adapt to the farm life is a<br/>prerequisite.<br/>• Excellent logical and critical thinking problem-solving skills.<br/>• Ability to meet set agreed business targets and deadlines<br/>• Ability to work independently and as part of a team, have a strong sense of personal<br/>organization.",
        "how_to_apply": "Should you meet the above criteria, kindly submit your application accompanied by a<br/>detailed one document Curriculum Vitae and certified academic certificates in PDF format<br/>ONLY by 31 January 2025. All applications should be emailed to: gffvacancy@gmail.com<br/>clearly stating the position being applied for as your email subject reference",
        "salary_amount": "TBA"
    },
    {
        "link": "https://vacancymail.co.zw/jobs/consultant-to-develop-online-learning-courses-for-the-emergency-obstetric-and-newborn-care-emonc-training-61994/",
        "title": "CONSULTANT TO DEVELOP ONLINE LEARNING COURSES FOR THE EMERGENCY OBSTETRIC AND NEWBORN CARE (EmONC) TRAINING",
        "company": "CORDAID",
        "location": "Harare",
        "expiry_time": "27 Dec 2024",
        "job_type": "Contractor",
        "duties_and_responsibilities": "Under this objective, the Consultant videographer and Facilitators will support the Ministry of Health and Child Care, and Cordaid/ World Bank to build their investments in Health. Particularly, to improve quality of MNCH services by contextualizing existing EmONC curriculum into audio lectures with video skills demonstration sessions of the key lifesaving interventions for 25 selected district hospitals and rolling out to the rest of the health facilities in Zimbabwe and beyond. The EmONC lectures will target primarily facility health care workers to include district and provincial level staff (PCNs, midwives and GMOs). This recording is an effort to address the continuous brain drain by qualified and experienced EmONC trainers and trained staff and will form part of legacy of World Bank and Cordaid Zimbabwe continuous quality improvement for health processes.  The Ministry of Health and Child Care hopes this will enable institutionalization of sustainable EmONC training.",
        "qualifications_and_experience": "Interested eligible Consultants may obtain further information and Terms of Reference from the following link: https://shorturl.at/xH0Yj or email Cordaid Zimbabwe Procurement on procurementzim@cordaid.org.",
        "how_to_apply": "Proposals to be submitted to Cordaid Zimbabwe Procurement procurementzim@cordaid.org, cc takudzwa.rusare@cordaid.org; blessmore.chitopo@cordaid.org; on or before 27 December  2024 at 17:00hrs.",
        "salary_amount": null
    },
    {
        "link": "https://vacancymail.co.zw/jobs/graduate-development-programe-gdp-college-students-61993/",
        "title": "Graduate Development Programe (GDP) - College Students",
        "company": "Green Feathers Farm Pvt Ltd",
        "location": "Wedza or Hwedza",
        "expiry_time": "31 Jan 2025",
        "job_type": "Full Time",
        "duties_and_responsibilities": "Job Related",
        "qualifications_and_experience": "Job Skills and Competences<br/>• Willingness to relocate, stay and live on the farm, and adapt to the farm life is a<br/>prerequisite.<br/>• Excellent logical and critical thinking problem-solving skills.<br/>• Possession of strong interpersonal skills.",
        "how_to_apply": "Should you meet the above criteria, kindly submit your application accompanied by a<br/>detailed one document Curriculum Vitae and certified academic certificates in PDF format<br/>ONLY by 31 January 2025. All applications should be emailed to: gffvacancy@gmail.com<br/>clearly stating the position being applied for as your email subject reference",
        "salary_amount": "TBA"
    }
]